terranblake/Esp32_oscilloscope/servers/oscilloscope.h
        } // while sampling

        // wait for the STOP signal
        while (((oscSharedMemory *) sharedMemory)->oscReaderState != STOP) delay (1);
        ((oscSharedMemory *) sharedMemory)->oscReaderState = STOPPED; 

        vTaskDelete (NULL);
    }

    // oscReader that takes analog samples (analogRead) on time interval specified in microseconds
    //  - it can only read 1 or 2 digital signals
    //  - it can only work in 'screen at a time' mode (which is not a drawback for the sampling is measured in microseconds)
    void oscReader_analog (void *sharedMemoryPtr) { // Changed parameter name for clarity
        oscSharedMemory *sharedMemory = (oscSharedMemory *) sharedMemoryPtr; // Get typed pointer

        // Extract configuration from shared memory
        OscChannelConfig *channelConfig = sharedMemory->channelConfig;
        uint8_t numActiveChannels = sharedMemory->numActiveChannels;
        int samplingTime = sharedMemory->samplingTime;
        unsigned long screenWidthTime = sharedMemory->screenWidthTime;
        oscSamples *readBuffer = &sharedMemory->readBuffer;
        oscSamples *sendBuffer = &sharedMemory->sendBuffer;

        // Identify the trigger channel (first active analog channel for now)
        int triggerChannelIndex = -1;
        adc1_channel_t triggerAdcChannel = ADC1_CHANNEL_MAX; // Default invalid
        bool positiveTrigger = false;
        bool negativeTrigger = false;
        int positiveTriggerTreshold = 0;
        int negativeTriggerTreshold = 0;

        uint8_t numActiveAnalog = 0;
        for (int i = 0; i < MAX_OSC_CHANNELS; ++i) {
            if (channelConfig[i].is_active && channelConfig[i].is_analog) {
                numActiveAnalog++;
                if (triggerChannelIndex == -1) { // Use first active analog channel for trigger
                    triggerChannelIndex = i;
                    triggerAdcChannel = channelConfig[i].adc_channel;
                    positiveTrigger = channelConfig[i].posTriggerEnabled;
                    negativeTrigger = channelConfig[i].negTriggerEnabled;
                    positiveTriggerTreshold = channelConfig[i].posTriggerTreshold;
                    negativeTriggerTreshold = channelConfig[i].negTriggerTreshold;
                }
            }
        }

        // Check if any analog channels are active
        if (numActiveAnalog == 0) {
             __oscilloscope_h_debug__("oscReader_analog: No active analog channels. Stopping.");
             sharedMemory->oscReaderState = STOPPED; // Ensure it stops cleanly
             vTaskDelete(NULL);
             return; // Should not happen if started correctly, but safety check
        }


        // --- REMOVE OLD VARIABLE EXTRACTION ---
        // bool positiveTrigger =              ((oscSharedMemory *) sharedMemory)->positiveTrigger;
        // bool negativeTrigger =              ((oscSharedMemory *) sharedMemory)->negativeTrigger;
        // unsigned char gpio1 =               (unsigned char) ((oscSharedMemory *) sharedMemory)->gpio1; // easier to check validity with unsigned char then with integer
        // unsigned char gpio2 =               (unsigned char) ((oscSharedMemory *) sharedMemory)->gpio2; // easier to check validity with unsigned char then with integer
        // unsigned char noOfSignals = 1; if (gpio2 <= 39) noOfSignals = 2;  // monitor 1 or 2 signals
        // adc1_channel_t adcchannel1 =        ((oscSharedMemory *) sharedMemory)->adcchannel1;
        // adc1_channel_t adcchannel2 =        ((oscSharedMemory *) sharedMemory)->adcchannel2;
        // int positiveTriggerTreshold =       ((oscSharedMemory *) sharedMemory)->positiveTriggerTreshold;
        // int negativeTriggerTreshold =       ((oscSharedMemory *) sharedMemory)->negativeTriggerTreshold;
        // unsigned long screenWidthTime =     ((oscSharedMemory *) sharedMemory)->screenWidthTime;
        // oscSamples *readBuffer =            &((oscSharedMemory *) sharedMemory)->readBuffer;
        // oscSamples *sendBuffer =            &((oscSharedMemory *) sharedMemory)->sendBuffer;
        // --- END REMOVE OLD VARIABLE EXTRACTION ---


        // Adjust sampling time calculation based on MAX_OSC_SAMPLES_PER_PACKET
        // MAX_OSC_SAMPLES_PER_PACKET includes the initial dummy message slot
        if ((unsigned long) samplingTime * (MAX_OSC_SAMPLES_PER_PACKET - 1) < screenWidthTime) {
             samplingTime = max ((int) (screenWidthTime / (MAX_OSC_SAMPLES_PER_PACKET - 1)) + 1, 1);
             char dbg_msg_samp[150];
             snprintf(dbg_msg_samp, sizeof(dbg_msg_samp), "oscReader_analog: %d analog channels. SamplingTime adjusted to %d us due to buffer size and screenWidthTime.", numActiveAnalog, samplingTime);
             __oscilloscope_h_debug__(dbg_msg_samp);
        }

        // --- REMOVE OLD SAMPLING TIME ADJUSTMENT ---
        // if (noOfSignals == 1) {
        //     if ((unsigned long) samplingTime * (OSCILLOSCOPE_1SIGNAL_BUFFER_SIZE - 2) < screenWidthTime) {
        //         samplingTime = max ((int) (screenWidthTime / (OSCILLOSCOPE_1SIGNAL_BUFFER_SIZE - 2)) + 1, 1); // + 1 just to be on the safe side due to integer calculation rounding
        //         __oscilloscope_h_debug__ ("oscReader_analog: 1 signal samplingTime was too short (regarding to buffer size) and is corrected to " + String (samplingTime));
        //     }
        // } else {
        //     if ((unsigned long) samplingTime * (OSCILLOSCOPE_2SIGNALS_BUFFER_SIZE - 2) < screenWidthTime) {
        //         samplingTime = max ((int) (screenWidthTime / (OSCILLOSCOPE_2SIGNALS_BUFFER_SIZE - 2)) + 1, 1); // + 1 just to be on the safe side due to integer calculation rounding
        //         __oscilloscope_h_debug__ ("oscReader_analog: 2 signals samplingTime was too short (regarding to buffer size) and is corrected to " + String (samplingTime));
        //     }
        // }
        // --- END REMOVE OLD SAMPLING TIME ADJUSTMENT ---

        // Is samplingTime is too long for 15 bits? Make a correction. Max sample time can be 32767 (15 bits) but since in some case actual sample time can be much larger than required let's keep it below 5000.
        if (samplingTime > 5000) {
                samplingTime = 5000;
                // __oscilloscope_h_debug__ ("oscReader_analog: samplingTime was too long (to fit in 15 bits in (almost?) all cases) and is corrected to " + String (samplingTime));
                cout << "oscReader_analog: samplingTime was too long (to fit in 15 bits in (almost?) all cases) and is corrected to " << samplingTime << endl; // Keep cout for now
        }

