terranblake/Esp32_oscilloscope/servers/oscilloscope.h
        /**/ // Keep debug output for now, update later if needed
        cout << "----- oscReader_analog () -----\\r\\n";
        cout << "samplingTime " << samplingTime << " us" << endl;
        cout << "Trigger Ch Idx: " << triggerChannelIndex << " (ADC: " << triggerAdcChannel << ")" << endl;
        cout << "positiveTrigger " << positiveTrigger << endl;
        cout << "negativeTrigger " << negativeTrigger << endl;
        cout << "positiveTriggerTreshold " << positiveTriggerTreshold << endl;
        cout << "negativeTriggerTreshold " << negativeTriggerTreshold << endl;
        cout << "screenWidthTime " << screenWidthTime << endl;
        cout << "numActiveAnalog " << numActiveAnalog << endl;
        cout << "max number of samples (incl. dummy) " << MAX_OSC_SAMPLES_PER_PACKET << endl;
        cout << "max possible screenWidthTime covered by samples " << (long long)samplingTime * (MAX_OSC_SAMPLES_PER_PACKET -1) << endl; // Use long long for calculation
        delay (100);
        /**/

        // Calculate screen refresh period. It sholud be arround 50 ms (sustainable screen refresh rate is arround 20 Hz) but it is better if it is a multiple value of screenWidthTime.
        unsigned long screenRefreshMilliseconds; // screen refresh period
        int noOfSampleSetsPerScreen = screenWidthTime / samplingTime; if ((unsigned long)noOfSampleSetsPerScreen * samplingTime < screenWidthTime) noOfSampleSetsPerScreen ++; // Number of *sets* of samples
        unsigned long correctedScreenWidthTime = (unsigned long)noOfSampleSetsPerScreen * samplingTime;
        screenRefreshMilliseconds = correctedScreenWidthTime >= 50000 ? correctedScreenWidthTime / 1000 : ((50500 / correctedScreenWidthTime) * correctedScreenWidthTime) / 1000;

        char dbg_msg_timing[150];
        snprintf(dbg_msg_timing, sizeof(dbg_msg_timing), "oscReader_analog: samplingTime = %d, screenWidthTime = %lu, corrected = %lu, refresh = %lu ms",
                 samplingTime, screenWidthTime, correctedScreenWidthTime, screenRefreshMilliseconds);
        __oscilloscope_h_debug__(dbg_msg_timing);


        readBuffer->samplesAreReady = true; // this information will be always copied to sendBuffer together with the samples

        // ADC setup (Assuming ADC handles are already configured and stored in channelConfig during runOscilloscope)
        // No GPIO setup needed here as ADC config handles it.


        // wait for the START signal
        while (sharedMemory->oscReaderState != START) delay (1);
        sharedMemory->oscReaderState = STARTED;

        // --- do the sampling, samplingTime and screenWidthTime are in us ---

        // triggered or untriggered mode of operation
        bool triggeredMode = (triggerChannelIndex != -1) && (positiveTrigger || negativeTrigger);

        TickType_t lastScreenRefreshTicks = xTaskGetTickCount ();               // for timing screen refresh intervals

        // Temporary storage for samples read in one go
        int adc_raw[MAX_OSC_CHANNELS]; // Max possible channels

        while (sharedMemory->oscReaderState == STARTED) { // sampling from the left of the screen - while not getting STOP signal

            unsigned long screenTime = 0;                                       // in us - how far we have already got from the left of the screen (we'll compare this value with screenWidthTime)
            unsigned long deltaTime = 0;                                        // in us - delta from previous sample
            unsigned long lastSampleMicroseconds = micros ();                   // for sample timing
            unsigned long newSampleMicroseconds = lastSampleMicroseconds;

            // TODO: Define and insert the correct multi-channel dummy message.
            // This message needs to convey the number and type (A/D) of active channels.
            // For now, using a placeholder. The client JS needs updating to parse this.
            readBuffer->samplesMultiChannel[0].num_channels = numActiveAnalog; // Example placeholder
            readBuffer->samplesMultiChannel[0].delta_time = -1; // Indicate dummy message
            for(int k=0; k<numActiveAnalog; ++k) readBuffer->samplesMultiChannel[0].values[k] = -1; // Placeholder values
            readBuffer->sampleCount = 1;


            if (triggeredMode) { // if no trigger is set then skip this (waiting) part and start sampling immediatelly

                // take the first sample for the trigger channel
                int lastTriggerSampleValue = -1;
                // Assume adc_oneshot_read is thread-safe or handle potential conflicts if needed
                esp_err_t read_ret = adc_oneshot_read(channelConfig[triggerChannelIndex].adc_handle, channelConfig[triggerChannelIndex].adc_channel, &lastTriggerSampleValue);
                if (read_ret != ESP_OK) {
                    char dbg_msg_adc[100];
                    snprintf(dbg_msg_adc, sizeof(dbg_msg_adc), "ADC Read Error (Trigger - Last): %s", esp_err_to_name(read_ret));
                    __oscilloscope_h_debug__(dbg_msg_adc);
                    // Handle error? Maybe retry or stop? For now, log and continue with -1
                    lastTriggerSampleValue = -1; // Indicate error?
                }
                #ifdef INVERT_ADC1_GET_RAW
                    if (lastTriggerSampleValue != -1) lastTriggerSampleValue = 4095 - lastTriggerSampleValue;
                #endif


                // wait for trigger condition
                while (sharedMemory->oscReaderState == STARTED) {
                    // wait before continuing to next sample and calculate delta offset for it
                    while ((deltaTime = (newSampleMicroseconds = micros ()) - lastSampleMicroseconds) < samplingTime) delayMicroseconds (1);
                    lastSampleMicroseconds = newSampleMicroseconds;

                    // take the second sample for the trigger channel
                    int newTriggerSampleValue = -1;
                    read_ret = adc_oneshot_read(channelConfig[triggerChannelIndex].adc_handle, channelConfig[triggerChannelIndex].adc_channel, &newTriggerSampleValue);
                    if (read_ret != ESP_OK) {
                       char dbg_msg_adc[100];
                       snprintf(dbg_msg_adc, sizeof(dbg_msg_adc), "ADC Read Error (Trigger - New): %s", esp_err_to_name(read_ret));
                       __oscilloscope_h_debug__(dbg_msg_adc);
                       newTriggerSampleValue = -1;
                    }
                   #ifdef INVERT_ADC1_GET_RAW
                       if (newTriggerSampleValue != -1) newTriggerSampleValue = 4095 - newTriggerSampleValue;
                   #endif

