terranblake/Esp32_oscilloscope/servers/oscilloscope.h
                    // Compare both samples to check if the trigger condition has occured
                    if (lastTriggerSampleValue != -1 && newTriggerSampleValue != -1 && // Check for valid reads
                        ((positiveTrigger && lastTriggerSampleValue < positiveTriggerTreshold && newTriggerSampleValue >= positiveTriggerTreshold) ||
                         (negativeTrigger && lastTriggerSampleValue > negativeTriggerTreshold && newTriggerSampleValue <= negativeTriggerTreshold)))
                    {
                        // trigger condition has occured, insert both trigger samples conceptually
                        // We need to read *all* active analog channels for these two time points

                        // --- Conceptual insertion point 1 (corresponds to lastTriggerSampleValue time) ---
                        // Read all *other* active analog channels at this time point (approximately)
                        // Store this set of samples. Delta time = 0 for the first set.

                        // --- Conceptual insertion point 2 (corresponds to newTriggerSampleValue time) ---
                        // Read all active analog channels *again* (approximately deltaTime later)
                        // Store this second set of samples. Delta time = deltaTime.

                        // TODO: Implement reading *all* active analog channels for the two trigger points
                        // and store them correctly in readBuffer->samplesMultiChannel[1] and [2]
                        // For now, we skip this detailed insertion and just break to start normal sampling.
                        // This means the first few samples after the trigger might be missing or have incorrect timing.

                        __oscilloscope_h_debug__("Trigger condition met.");

                        screenTime = deltaTime; // Start measuring screen time from the 'new' sample time
                        // readBuffer->sampleCount = 3; // If we were inserting the two trigger points

                        // Need to read the *current* sample set for all channels to start the main loop
                        int activeAnalogIdx = 0;
                        for (int i = 0; i < MAX_OSC_CHANNELS; ++i) {
                            if (channelConfig[i].is_active && channelConfig[i].is_analog) {
                                int val = -1;
                                read_ret = adc_oneshot_read(channelConfig[i].adc_handle, channelConfig[i].adc_channel, &val);
                                if (read_ret != ESP_OK) val = -1; // Handle error
                                #ifdef INVERT_ADC1_GET_RAW
                                    if (val != -1) val = 4095 - val;
                                #endif
                                adc_raw[activeAnalogIdx++] = val; // Store in temp array
                            }
                        }
                        // Store the *current* full sample set (this corresponds approx to newTriggerSampleValue time)
                        if (readBuffer->sampleCount < MAX_OSC_SAMPLES_PER_PACKET) {
                            readBuffer->samplesMultiChannel[readBuffer->sampleCount].delta_time = (int16_t)deltaTime; // Or should this be 0 for the first post-trigger? Needs thought.
                            readBuffer->samplesMultiChannel[readBuffer->sampleCount].num_channels = numActiveAnalog;
                             for(int k=0; k<numActiveAnalog; ++k) {
                                readBuffer->samplesMultiChannel[readBuffer->sampleCount].values[k] = (int16_t)adc_raw[k];
                             }
                             readBuffer->sampleCount++;
                        } else {
                             __oscilloscope_h_debug__("Trigger: Buffer full immediately!");
                        }


                        // Update lastSampleMicroseconds *after* reading the current sample set
                        lastSampleMicroseconds = micros(); // Reset timing base for next sample
                        deltaTime = 0; // Reset delta for the loop logic


                        break; // trigger event occured, stop waiting and proceed to sampling
                    } else {
                        // Trigger not met, update last sample value and continue waiting
                        lastTriggerSampleValue = newTriggerSampleValue;
                    }
                } // while not triggered
            } // if in trigger mode


            // take (the rest of the) samples that fit on one screen
            while (sharedMemory->oscReaderState == STARTED) {

                 // Check buffer full condition first
                 if (readBuffer->sampleCount >= MAX_OSC_SAMPLES_PER_PACKET) {
                      __oscilloscope_h_debug__("Analog Read: Buffer full.");
                      // Buffer is full, copy to send buffer if possible
                      if (!sendBuffer->samplesAreReady) {
                          memcpy(sendBuffer, readBuffer, sizeof(oscSamples)); // Use memcpy for efficiency
                          sendBuffer->samplesAreReady = true; // Ensure flag is set (memcpy copies it, but good practice)
                          __oscilloscope_h_debug__("Analog Read: Copied full buffer to sendBuffer.");
                      } else {
                          __oscilloscope_h_debug__("Analog Read: Send buffer busy, dropping frame.");
                          // send buffer with previous frame is still waiting, drop this frame
                      }
                      break; // Break inner loop to start new frame cycle
                 }

                 // Check if we already passed screenWidthTime
                 if (screenTime >= screenWidthTime) {
                     __oscilloscope_h_debug__("Analog Read: Screen time reached.");
                     // Screen time reached, copy potentially partial buffer to send buffer
                     if (!sendBuffer->samplesAreReady) {
                         memcpy(sendBuffer, readBuffer, sizeof(oscSamples)); // Copy current buffer state
                         sendBuffer->samplesAreReady = true;
                          __oscilloscope_h_debug__("Analog Read: Copied partial buffer to sendBuffer.");
                     } else {
                         __oscilloscope_h_debug__("Analog Read: Send buffer busy, dropping partial frame.");
                         // send buffer busy, drop frame
                     }
                     break; // Break inner loop to start new frame cycle
                 }


                // --- Read all active analog channels ---
                int activeAnalogIdx = 0;
                for (int i = 0; i < MAX_OSC_CHANNELS; ++i) {
                    if (channelConfig[i].is_active && channelConfig[i].is_analog) {
                        int val = -1;
                        esp_err_t read_ret = adc_oneshot_read(channelConfig[i].adc_handle, channelConfig[i].adc_channel, &val);

                        if (read_ret != ESP_OK) {
                            char dbg_msg_adc[100];
                            snprintf(dbg_msg_adc, sizeof(dbg_msg_adc), "ADC Read Error (Chan %d): %s", i, esp_err_to_name(read_ret));
                            __oscilloscope_h_debug__(dbg_msg_adc);
                            val = -1; // Indicate error in data? Or use previous value? For now -1.
                        }

                        #ifdef INVERT_ADC1_GET_RAW
                            if (val != -1) val = 4095 - val;
                        #endif
                        adc_raw[activeAnalogIdx++] = val; // Store in temp array
                    }
                }

